## HIERARCHICAL INDEXING

In [1]:
# enables having multiple index levels on an axis
# provides way to work with higher dimensional data in lower dimensional form

In [2]:
import pandas as pd
import numpy as np

In [3]:
# prettified view of a Series with a MultiIndex as its index
data = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.001235
   2    0.134436
   3   -0.200119
b  1    0.938150
   3   -0.593246
c  1    0.741810
   2   -1.988431
d  2   -0.467234
   3    0.274096
dtype: float64

In [4]:
# unstacked version
data.unstack()

          1         2         3
a -0.001235  0.134436 -0.200119
b  0.938150       NaN -0.593246
c  0.741810 -1.988431       NaN
d       NaN -0.467234  0.274096

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [6]:
# with hierarchical indexed object, partial indexing is possible
# concisely select subsets of data
data['a']

1   -0.001235
2    0.134436
3   -0.200119
dtype: float64

In [7]:
data['b']

1    0.938150
3   -0.593246
dtype: float64

In [8]:
data['c']

1    0.741810
2   -1.988431
dtype: float64

In [9]:
data['d']

2   -0.467234
3    0.274096
dtype: float64

In [10]:
# slicing
data['b':'c']

b  1    0.938150
   3   -0.593246
c  1    0.741810
   2   -1.988431
dtype: float64

In [11]:
# non-slicing, location based retrieval
data.loc[['b', 'c']]

b  1    0.938150
   3   -0.593246
c  1    0.741810
   2   -1.988431
dtype: float64

In [12]:
data

a  1   -0.001235
   2    0.134436
   3   -0.200119
b  1    0.938150
   3   -0.593246
c  1    0.741810
   2   -1.988431
d  2   -0.467234
   3    0.274096
dtype: float64

In [13]:
# inner level selection
data.loc[:, 2]

a    0.134436
c   -1.988431
d   -0.467234
dtype: float64

In [14]:
# one more example
data.loc[:, :2]

a  1   -0.001235
   2    0.134436
b  1    0.938150
c  1    0.741810
   2   -1.988431
d  2   -0.467234
dtype: float64

In [15]:
# hierarchical indexing helps to reshape data and group-based ops
# ex. forming a pivot table

In [16]:
# rearrange data into a DataFrame using unstack method
data.unstack()

          1         2         3
a -0.001235  0.134436 -0.200119
b  0.938150       NaN -0.593246
c  0.741810 -1.988431       NaN
d       NaN -0.467234  0.274096

In [17]:
# In DF, either axis can have a hierarchical index
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], 
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [18]:
# hierarchical levels can have names as strings or a Python object

In [19]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
# partial column indexing to select groups of columns
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [21]:
# MultiIndex can be created by itself and then reused
# columns preceding DF with level names could be created
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### REORDERING AND SORTING LEVELS

In [22]:
# rearrange order of levels on an axis or sort the data by values in one specific level
# swaplevel - takes two level numbers or names and returns a new object with the levels interchanged
# data remains unaltered

In [23]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [24]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [25]:
# sort_index - sorts the data using only the values in a single level
# sort_index is used with swaplevel to obtain a lexicographically sorted result by the indicated level

In [26]:
# here keys will sort in ascending order
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [27]:
# combine swaplevel and sort_level - level=0
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [28]:
# combine swaplevel and sort_level - level=1
frame.swaplevel(0, 1).sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

# NOTE:
“Data selection performance is much better on hierarchically indexed objects if the index is lexicographically sorted starting with the outermost level — that is, the result of calling sort_index(level=0) or sort_index().”

### SUMMARY STATISTICS BY LEVEL

In [29]:
# level - specify the level to aggregate by on a particular axis
# aggregate by level on either the rows or columns

In [30]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [31]:
# will sum all individual values belonging to 'key1'
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [32]:
# will sum all individual values from 'key2'
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [33]:
# sum values based by 'color' column
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### INDEXING WITH DATAFRAME'S COLUMNS

In [34]:
# condition - use one or more columns from a DF as the row index
# can be done by moving row index into the DF's columns

In [35]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 
                            'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [36]:
# set_index - creates a new DF using one or more of its columns as index
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [37]:
# columns are removed from DF but to keep them use
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [38]:
# reset_index - opposite of set_index
# hierarchical index levels are moved into the columns

In [39]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

### COMBINING AND MERGING DATASETS

In [40]:
# pandas.merge - connects row in DF based on one or more keys
# pandas.concat - concatenates or 'stacks' together objects along an axis
# combine_first - enables splicing together overlapping data
# i.e to fill in missing values in one object with values from another

### DATABASE-STYLE DATAFRAME JOINS

In [41]:
# merge/join - combine datasets by linking rows using one or more keys

In [42]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [43]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [44]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [45]:
# df1 - multiple rows labeled a and b
# df2 - has only one row for each value in 'key' column

In [46]:
# many-to-one join ops

In [47]:
# calling merge
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [48]:
# not mentioning which column to join will use the overlapping column names as the key
# should be specified explicitly - good practice!

In [49]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [50]:
# different column names in each object? - specify them separately

In [51]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [52]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [53]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [54]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [55]:
# values for 'c' and 'd' and it's data are missing
# this is due to merge performing a 'inner join' by default
# the keys in the result are intersected or common set found values from both tables

# join options - left, right and outer

# outer join takes the union of keys, combining the effect of applying left and right joins

In [56]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [57]:
# many-to-many merges ops

In [58]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [59]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [60]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [61]:
# performs Cartesian product of the rows
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [62]:
# join method only affects the distinct key values

In [63]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [64]:
# merge with multiple keys, pass a list of column names
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [65]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [66]:
# specify strings to append to overlapping names in left and right DF
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [67]:
# suffixies
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on Index

In [68]:
# merge key in a DF can be found in its index
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': range(6)})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [69]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [70]:
right1

   group_val
a        3.5
b        7.0

In [71]:
# intersect the join keys
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [72]:
# form union of keys with outer join
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [73]:
# hierarchical indexed data - more complications while merging
# here joining on index is implicitly a multiple-key merge

In [74]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 
                               'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': np.arange(5.)})

righth = pd.DataFrame(np.arange(12).reshape((6,2)),
                      index=[['Nevada', 'Nevada',
                              'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                             [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [75]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [76]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [77]:
# indicate multiple columns to merge on as a list
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [78]:
# handle duplicate values with how='outer'
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [79]:
# using indexes of both sides of the merge
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Nevada'])

right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Missouri', 'Alabama'])

In [80]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [81]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [82]:
pd.merge(left2, right2, how='outer', 
         left_index=True, 
         right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [83]:
# performing above with join instance
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [84]:
# joining index of passed DF on one of the columns of calling DF

In [85]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [86]:
right1

   group_val
a        3.5
b        7.0

In [87]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [88]:
# simple index-on-index merge
another = pd.DataFrame([[7., 8.], [9., 10.], 
                        [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'],
                       columns=['New York', 'Oregon'])
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [89]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [90]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [91]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [131]:
# including all items
left2.join([right2, another], how='outer', sort=False)

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

### CONCATENATING ALONG AN AXIS

In [93]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [94]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [95]:
arr_string = [['A', 'B'], 
              ['C', 'D']]
arr_string

[['A', 'B'], ['C', 'D']]

In [96]:
np.concatenate([arr_string, arr_string], axis=1)

array([['A', 'B', 'A', 'B'],
       ['C', 'D', 'C', 'D']], dtype='<U1')

In [97]:
# having labeled axes enables to further generalise array concate

In [98]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

In [99]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [100]:
# concate by default works along axis=0, producing another Series
# passing axis=1 will result in sorted union of indexes
pd.concat([s1, s2, s3], axis=1, sort=False)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [101]:
# intersect them by passing join='inner'
s4 = pd.concat([s1, s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [102]:
pd.concat([s1, s4], axis=1, sort=False)

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [103]:
pd.concat([s1, s4], axis=1, sort=False, join='inner')

   0  1
a  0  0
b  1  1

In [104]:
# specify axies to be used on the other axes with join_axes
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e', 'f', 'g']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN
f  NaN  5.0
g  NaN  6.0

In [105]:
# concatenated pieces are not identifiable in the results
# create a hierarchical index on the concatenation axis
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [106]:
result.unstack()

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [107]:
# combining Series along axis=1, the keys become DF's column headers
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'], sort=False)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [108]:
# above login on DF
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                   index=['a', 'b', 'c'],
                   columns=['one', 'two'])
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three', 'four'])

In [109]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [110]:
df2

   three  four
a      5     6
c      7     8

In [111]:
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'], 
          sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [112]:
# passing a dict of objects instead of a list, the dict's keys will be used for keys option
pd.concat({'level1': df1, 'level2': df2}, axis=1, sort=False)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [113]:
# naming created axis levels
pd.concat([df1, df2], axis=1, 
          keys=['level1', 'level2'],
          names=['upper', 'lower'],
          sort=False)

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [114]:
# DF where row index does not contain any relevant data
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [115]:
df1

          a         b         c         d
0 -0.348107  0.071185  0.767445 -0.465900
1 -1.129052  1.094329 -1.109816 -0.523340
2 -0.848770  0.779535 -0.123288 -0.302066

In [116]:
df2

          b         d         a
0 -0.331481 -0.521435 -2.310006
1 -0.104321  0.447425  0.701306

In [117]:
pd.concat([df1, df2], ignore_index=True, sort=False)

          a         b         c         d
0 -0.348107  0.071185  0.767445 -0.465900
1 -1.129052  1.094329 -1.109816 -0.523340
2 -0.848770  0.779535 -0.123288 -0.302066
3 -2.310006 -0.331481       NaN -0.521435
4  0.701306 -0.104321       NaN  0.447425

### COMBINING DATA WITH OVERLAP

In [118]:
# some data combination situations cannot be expressed as a merge or concate
# case would be having two datasets with overlapping indexes in full or part
# Numpy's where function - performs array oriented equivalent of an if-else expression

In [119]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
              index=['f', 'e', 'd', 'c', 'b', 'a'])
b = pd.Series(np.arange(len(a), dtype=np.float64),
              index=['f', 'e', 'd', 'c', 'b', 'a'])

In [120]:
b[-1] = np.nan

In [121]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [122]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [123]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [124]:
# combine_first - functions same as above with pandas usual data alignment logic
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [125]:
# with DF - combine_first works column by column, patching missing data in calling object
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],
                    'b': [np.nan, 2., np.nan, 6.],
                    'c': range(2, 18, 4)})
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.],
                    'b': [np.nan, 3., 4., 6., 8.]})

In [126]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [127]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [128]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## RESHAPING AND PIVOTING

### RESHAPING WITH HIERARCHICAL INDEXING

In [129]:
# provides a consistent way to rearrange data in DF
# stack - rotates or pivots from the columns in the data to the rows
# unstack - pivots from the rows into the columns

In [132]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [134]:
# using stack will pivot the column into the row, producing a Series
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [135]:
# from a hierarchical indexed Series, stack() will rearrange the data back into DF

In [137]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [138]:
# by default, innermost level is unstacked
# unstacking different level by passing a level number or name

In [143]:
# level number-wise
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [141]:
# level state-wise
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [144]:
# unstacking can produce missing data if all values in the level are not found

In [145]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [146]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [147]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [148]:
# stacking filters out missing data by default
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [149]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [151]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [156]:
# unstack in DF, level unstacked becomes lowest level in the result
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [157]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [158]:
# calling stack, indicate name of the axis to stack
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### PIVOTING "Long" TO "Wide" FORMAT

In [159]:
# long/stacked format - stores multiple time series in dbs and csv

In [173]:
data = pd.read_csv('../resources/examples/macrodata.csv')
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [174]:
# PeriodIndex - combines year and quarter columns to create a kind of time interval type
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
                         name='date')
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

data = data.reindex(columns=columns)
data.index = periods.to_timestamp('D', 'end')

ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [171]:
ldata[:10]

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

In [175]:
# above is long format for multiple time series
# works with observational data with two or more keys
# each row in the table represents a single obs

# data is frequently stored this way in RDBMS like MySQL as a fixed schema
# in above example, data and item would usually be the primary keys

# much easier is to have a DF containing one column per distinct item value indexed by timestamps in the date column

In [176]:
# DF's pivot method performs above transformation

In [177]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted

item        infl    realgdp  unemp
date
1959-03-31  0.00   2710.349    5.8
1959-06-30  2.34   2778.801    5.1
1959-09-30  2.74   2775.488    5.3
1959-12-31  0.27   2785.204    5.6
1960-03-31  2.31   2847.699    5.2
1960-06-30  0.14   2834.390    5.2
1960-09-30  2.70   2839.022    5.6
1960-12-31  1.21   2802.616    6.3
1961-03-31 -0.40   2819.264    6.8
1961-06-30  1.47   2872.005    7.0
1961-09-30  0.80   2918.419    6.8
1961-12-31  0.80   2977.830    6.2
1962-03-31  2.26   3031.241    5.6
1962-06-30  0.13   3064.709    5.5
1962-09-30  2.11   3093.047    5.6
1962-12-31  0.79   3100.563    5.5
1963-03-31  0.53   3141.087    5.8
1963-06-30  2.75   3180.447    5.7
1963-09-30  0.78   3240.332    5.5
1963-12-31  2.46   3264.967    5.6
1964-03-31  0.13   3338.246    5.5
1964-06-30  0.90   3376.587    5.2
1964-09-30  1.29   3422.469    5.0
1964-12-31  2.05   3431.957    5.0
1965-03-31  1.28   3516.251    4.9
1965-06-30  2.54   3563.960    4.7
1965-09-30  0.89   3636.285    4.4
1965-12-31  2.90   3724.014    4.1
1966-03-31  4.99   3815.423    3.9
1966-06-30  2.10   3828.124    3.8
...          ...        ...    ...
2002-06-30  1.56  11538.770    5.8
2002-09-30  2.66  11596.430    5.7
2002-12-31  3.08  11598.824    5.8
2003-03-31  1.31  11645.819    5.9
2003-06-30  1.09  11738.706    6.2
2003-09-30  2.60  11935.461    6.1
2003-12-31  3.02  12042.817    5.8
2004-03-31  2.35  12127.623    5.7
2004-06-30  3.61  12213.818    5.6
2004-09-30  3.58  12303.533    5.4
2004-12-31  2.09  12410.282    5.4
2005-03-31  4.15  12534.113    5.3
2005-06-30  1.85  12587.535    5.1
2005-09-30  9.14  12683.153    5.0
2005-12-31  0.40  12748.699    4.9
2006-03-31  2.60  12915.938    4.7
2006-06-30  3.97  12962.462    4.7
2006-09-30 -1.58  12965.916    4.7
2006-12-31  3.30  13060.679    4.4
2007-03-31  4.58  13099.901    4.5
2007-06-30  2.75  13203.977    4.5
2007-09-30  3.45  13321.109    4.7
2007-12-31  6.38  13391.249    4.8
2008-03-31  2.82  13366.865    4.9
2008-06-30  8.53  13415.266    5.4
2008-09-30 -3.16  13324.600    6.0
2008-12-31 -8.79  13141.920    6.9
2009-03-31  0.94  12925.410    8.1
2009-06-30  3.37  12901.504    9.2
2009-09-30  3.56  12990.341    9.6

[203 rows x 3 columns]

In [178]:
# pivoted = ldata.pivot('date', 'item', 'value')
# first two values are the columns to be used as the row and column index
# an optional value column to fill the DF

In [180]:
# reshaping two value columns simultaneously
ldata['value2'] = np.random.randn(len(ldata))
ldata[:10]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -0.101198
1 1959-03-31     infl     0.000  1.741756
2 1959-03-31    unemp     5.800  1.033748
3 1959-06-30  realgdp  2778.801 -0.142261
4 1959-06-30     infl     2.340  1.473993
5 1959-06-30    unemp     5.100 -0.330544
6 1959-09-30  realgdp  2775.488 -0.399602
7 1959-09-30     infl     2.740  1.421196
8 1959-09-30    unemp     5.300  0.407375
9 1959-12-31  realgdp  2785.204  0.875652

In [181]:
# omitting the last arg will result in a DF with hierarchical columns
pivoted = ldata.pivot('date', 'item')
pivoted[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8  1.741756 -0.101198  1.033748
1959-06-30  2.34  2778.801   5.1  1.473993 -0.142261 -0.330544
1959-09-30  2.74  2775.488   5.3  1.421196 -0.399602  0.407375
1959-12-31  0.27  2785.204   5.6  0.844830  0.875652 -0.217936
1960-03-31  2.31  2847.699   5.2  2.103354  0.707939  0.758550

In [182]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [186]:
# pivot is equivalent to creating a hierarchical index
# use set_index followed by a call to unstack
unstacked = ldata.set_index(['date', 'item']).unstack('item')
unstacked[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8  1.741756 -0.101198  1.033748
1959-06-30  2.34  2778.801   5.1  1.473993 -0.142261 -0.330544
1959-09-30  2.74  2775.488   5.3  1.421196 -0.399602  0.407375
1959-12-31  0.27  2785.204   5.6  0.844830  0.875652 -0.217936
1960-03-31  2.31  2847.699   5.2  2.103354  0.707939  0.758550

### PIVOTING "Wide" TO "Long" FORMAT

In [187]:
# pandas.melt - inverse ops to pivot for DF
# instead of transforming one column into many new DFs, it merges multiple columns into one
# results in DF, longer than input
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [188]:
# 'key' - group indicator
# other columns - data values

In [189]:
melted = pd.melt(df, ['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [190]:
# using pivot, reshape melted DF to original layout
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [191]:
# pivot by default will create an index from the column used as row labels
# use reset_index to move data back into a column
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [192]:
# specify a subset of columns to use as a value columns
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [193]:
# pandas.melt can be used without any group identifiers
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [212]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6